frontend/views/layouts/main.php

SELECT * FROM `city`
---
            </div>
            <div class="header__town">
                <label>
                    <?php $cities = app\models\City::find()->asArray()->all(); ?>

SELECT * FROM `user` WHERE `id`=2
---
                         alt="Аватар пользователя">
                </a>
                <span class="header__account-name">
                 <?php print User::findOne(Yii::$app->user->id)->name ?>