frontend/views/tasks/tasks.php

SELECT * FROM `task` WHERE `status_id`=1 ORDER BY `creation_date` DESC
---

/* @var $this yii\web\View */
$this->title = 'Главная страница';
$tasks = app\models\Task::find()->where(['status_id' => 1])->orderBy('creation_date DESC')->all();