frontend/views/tasks/tasks.php


/* @var $this yii\web\View */
$this->title = 'Главная страница';
$tasks = app\models\Task::findAll(['status_id' => 1]);
$cat = app\models\Category::find()->all();
---
SELECT * FROM `task` WHERE `status_id`=1
SELECT * FROM `category` WHERE `id`=2